[{"id":"electronica","label":"Electronica","description":"Electronica is open to musicians and non-musicians.  They will explore the techniques and art of composing and producing electronic music through the use of electronic hardware. i.e. synthesizers, samplers, sequencers, loopers, vocoders, effect devices, and software. We will examine and create with the rhythmic components of beats, patterns, loops, words and melody within a group dynamic. Attention will be paid to creating a working musical language along with techniques for the structuring, developing and orchestrating for all composed pieces by the ensembles. There will be a presentation and multi-track recording of the produced pieces at the end of the term.  No previous experience required."},{"id":"ensemble-plus","label":"Ensemble Plus","description":"Ensemble Plus is open to instrumentalists and vocalists. Course work will explore intermediate theory and the process of utilizing these concepts into the composing, arranging, orchestrating and recording of scores. Techniques will be taught and applied to the structuring of rhythm, melody and harmony into manuscript form by utilizing supplied notation software. The ensemble will fit the musical pieces to a chosen visual (i.e. video/film, spoken word, advertisements, animation) and play live to it. Emphasis will be placed on learning how to apply the techniques used when writing and playing music within an ensemble to a live visual. All scores will be recorded into recording software and mastered into a master two track, along with a live presentation of the produced material at the end of the term. Pre-requisite: Ensemble I, Vocal Ensemble, Electronica or consent of instructor."},{"id":"vocal-ensemble","label":"Vocal Ensemble","description":"Vocal Ensemble is an introduction to proper vocal techniques. The ensembles will select their own material to produce and perform along with understanding and utilizing the structure and development within a vocal piece of music. Emphasis will be placed on building strong group dynamics and how these apply to both the creative process. performance and recording which will be at the end of the term."},{"id":"ensemble-unplugged","label":"Ensemble Unplugged","description":"Ensemble Unplugged will focus on reviewing scales and chords and the ways to utilize them within an ensemble when writing and producing original material. Orchestration will be the focus along with the many ways with which instrumentation supports and develops a piece of music acoustically. At the end of the term there will be a performance and recording of the produced material."},{"id":"ensemble-two","label":"Ensemble II","description":"Ensemble II will explore intermediate theory and the process of utilizing these concepts into the composing, arranging, orchestrating, recording, and producing for both electric and acoustic works within an ensemble.  Attention will be given on learning how to structure, develop and orchestrate within the range and timbre of each instrument and vocal within the arrangements. Basic recording and production techniques will be taught and applied to the multi-track recordings for all produced pieces. There will be a live presentation of the produced material at the end of the term. Pre-requisite: Ensemble I, Vocal Ensemble, Electronica or consent of instructor. "},{"id":"ensemble-one","label":"Ensemble I","description":"Do you play any instrument or sing? Ensemble I is open to all students who want to explore the process of composing, arranging and orchestrating original pieces in a musical group context. Beginning theory concepts will be taught and applied along with the techniques for structuring rhythm, melody and harmony into lead sheet form.  Emphasis will be placed on the importance of building strong group dynamics along with a working musical language.  At the end of the term there will be a live presentation of the produced material. No previous experience or expertise required."},{"id":"z_independent","label":"Independent"},{"id":"ensemble-three","label":"Ensemble III ","description":"Ensemble III is open to all instrumental orchestration and vocals. Students will expand upon their working theoretical knowledge through independent composition and then present their pieces to the ensemble for production, performance, and recording. "},{"id":"sound-design","label":"Sound Design ","description":"Sound Design course is open to all students who are interested in exploring the components of sound production through the use of software programs, multi-track recorders, samplers, mixers, equalizers and multi-effects.  The class will explore the sound design from many different genres of production and then focus on learning how to listen to the components of a pre-existing sound design. They will re-design these individual tracks into a new song through the use of Pro Tools which will require them to learn how to “ mix down” multi-tracks into new two track masters. Students will present their masters at the Venue, which is at the end of the term. No previous experience or expertise is required."},{"id":"viva-voce","label":"Viva Voce","description":"Viva Voce is open to all students who want to explore singing within a vocal group.  The ensemble will select songs to be produced and compose all arrangements and orchestrations utilizing notation software. Proper vocal technique and interpretation will be taught and then expanded upon. Emphasis will be placed on the importance of building strong group dynamics and how these apply to the creative process. There will be a presentation of the material at the end of the term. No previous experience or expertise required. \n"},{"id":"scoring-the-game","label":"Scoring the Game","description":"Scoring the Game is an introduction to recording and editing software. The student will create an original music score for a chosen game and explore the possibilities for various environments for the game to reside in. All music will be synched up to the visual for each game and then presented for performance."}]